performance.yml
config:
  target: "https://api.todoist.com"
  phases:
    - duration: 1
      arrivalRate: 1
      name: "Phase 1"
    - duration: 1
      arrivalRate: 1
      name: "Phase 2"
  plugins:
    faker:
      locale: en
  variables:
    baseTasksURL: "/rest/v1/tasks"
    firstName: "$faker.name.firstName"
  environments:
    production:
      target: "https://api.todoist.com"
      phases:
        - duration: 5
          arrivalRate: 1
    staging:
      target: "https://api.todoist.com"
      phases:
        - duration: 1
          arrivalRate: 1
  defaults:
    headers:
      Authorization: Bearer {{$processEnvironment.TOKEN}}
      Content-type: application/json
  ##processor: "./myProcessor.js"
scenarios:
  - flow:
      - get:
          url: "{{ baseTasksURL }}"
      - post:
          url: "{{ baseTasksURL }}"
          json:
            content: "Task with artillery"
          capture:
            json: "$.id"
            as: "id"
      - log: "Current id is {{ id }} created by {{ firstName }}"
      - get:
          url: '{{ baseTasksURL }}/{{ id }}'
      - post:
          url: '{{ baseTasksURL }}/{{ id }}'
          json:
            content: "Task with artillery updated by {{ firstName }}"
      - post:
          url: '{{ baseTasksURL }}/{{ id }}/close'
      - post:
          url: '{{ baseTasksURL }}/{{ id }}/reopen'
      - delete:
          url: '{{ baseTasksURL }}/{{ id }}'